nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt1180/sdmmc_examples/sdcard_polling/cm7/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_15 (coord N16), SD1_CD_B */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_CD_B_PERIPHERAL                                RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_CD_B_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SD1_CD_B_CHANNEL                                      15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SD1_CD_B_GPIO                                      RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SD1_CD_B_GPIO_PIN                                     15U   /*!< GPIO pin number */
#define BOARD_INITPINS_SD1_CD_B_GPIO_PIN_MASK                        (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_AD_14 (coord N14), SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITPINS_SD_PWREN_B_PERIPHERAL                              RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_SD_PWREN_B_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SD_PWREN_B_CHANNEL                                    14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SD_PWREN_B_GPIO                                    RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SD_PWREN_B_GPIO_PIN                                   14U   /*!< GPIO pin number */
#define BOARD_INITPINS_SD_PWREN_B_GPIO_PIN_MASK                      (1U << 14U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
